/* Wild Magic Surge table generator by tobloef
Paste this into your browser's developer console (F12)
The script will create a rollable table named "Wild Magic Surge" with all 50 possibilities.
You can of course use this script to create other rollable tables, all you have to do is to replace the values in the rows variable.
You can also define a weight for each possibility by including a weight property like this:
{ name: "Some name here", weight: 2 }
Enjoy!
*/

(function(){
    const rows = [
        {weight:120, name: `Кожного разу на початку свого ходу протягом наступної хвилини робвть новий кидок дикої магії, ігноруючи цей варіант при наступних кидках.` },
        {weight:30, name: `Дружній до вас Модрон Дводрон, з’являється у випадковому вільному місці в радіусі 60 футів від вас. Це створіння під контролем DM і зникає через 1 хвилину.` },
        {weight:30, name: `Дружній до вас Модрон Монодрон, з’являється у випадковому вільному місці в радіусі 60 футів від вас. Це створіння під контролем DM і зникає через 1 хвилину.` },
        {weight:30, name: `Дружній до вас Фламф, з’являється у випадковому вільному місці в радіусі 60 футів від вас. Це створіння під контролем DM і зникає через 1 хвилину.` },
        {weight:30, name: `Дружній до вас Єдиноріг, з’являється у випадковому вільному місці в радіусі 60 футів від вас. Це створіння під контролем DM і зникає через 1 хвилину.` },
        {weight:120, name: `Протягом наступної хвилини ви відновлюєте 5 очок здоров'я на початку кожного зі своїх ходів.` },
        {weight:120, name: `Своріння мають заваду на спас кидках проти наступного заклинання, яке ви кинете протягом наступної хвилини, якщо воно вимагає рятувального кидка.` },
        {weight:15, name: `Ви опиняєтеся в оточенні тихої, ефірної музики, яку чуєте лише ви і істоти у радіусі 5 футів. Ефект триває 1 хвилину` },
        {weight:15, name: `Ваш розмір збільшується на одну категорію. Ефект триває 1 хвилину` },
        {weight:15, name: `У вас виростає довга борода з пір'я, яка залишатиметься, поки ви не чхнете; в цей момент пір'я вибухає з вашого обличчя і зникає.` },
        {weight:15, name: `Ви повинні кричати, коли говорите. Ефект триває 1 хвилину` },
        {weight:15, name: `Ілюзорні метелики літають в повітрі в межах 10 футів від вас. Ефект триває 1 хвилину` },
        {weight:15, name: `На вашому чолі з'являється око, що дає вам перевагу на перевірках Мудрості (Сприйняття). Ефект триває 1 хвилину` },
        {weight:15, name: `Рожеві бульбашки виходять з вашого рота щоразу, коли ви говорите. Ефект триває 1 хвилину` },
        {weight:15, name: `Ваша шкіра набуває яскравого синього відтінку на 24 години або поки ефект не буде скасований заклинанням Зняти Прокляття.` },
        {weight:120, name: `Протягом наступної хвилини всі ваші заклинання з часом накладення в один хід мають час накладення у вигляді бонусного ходу.` },
        {weight:120, name: `Ви переноситеся на Астральний План до кінця вашого наступного ходу. Потім ви повертаєтеся в простір, який ви займали раніше, або в найближчий вільний простір, якщо той простір зайнятий.` },
        {weight:120, name: `Наступного разу, коли ви кинете заклинання, що завдає шкоди протягом наступної хвилини, не кидайте кубики на шкоду. Натомість використайте найбільше можливе значення для кожного кубика шкоди.` },
        {weight:120, name: `Ви отримуєте Стійкість до всіх видів шкоди протягом наступної хвилини.` },
        {weight:120, name: `Ви перетворюєтеся на горщик з рослиною до початку вашого наступного ходу. Поки ви перебуваєте в такому вигляді, ви маєте стан Нездатності (Incapacitated) та вразливість до всієї шкоди. Якщо ваші очки здоров'я зменшаться до 0, ваш горщик зламається, і ви повертаєтесь до звичайного вигляду.` },
        {weight:120, name: `Протягом наступної хвилини ви можете телепортуватися на відстань до 20 футів за бонусну дію на кожному з ваших ходів.` },
        {weight:120, name: `Ви та до трьох створінь, які ви виберете в радіусі 30 футів від вас, отримують стан Невидимості на 1 хвилину. Ця невидимість закінчується для створіння одразу після того, як воно зробить кидок атаки, завдасть шкоди або використає заклинання.` },
        {weight:120, name: `Протягом наступної хвилини вас оточує спектральний щит, що надає вам бонус +2 до класу броні та імунітет до заклинання Магічна Стріла.` },
        {weight:120, name: `У цей хід ви можете виконати одну додаткову дію.` },
        {weight:12, name: `Ви маєте використати заклинання Спантеличеність (Confusion). Заклинання не потребує концентрації.` },
        {weight:12, name: `Хмара Туману (Fog Cloud). Заклинання не потребує концентрації.` },
        {weight:12, name: `Ви маєте використати заклинання Вогняна Куля (Fireball).` },
        {weight:12, name: `Ви маєте використати заклинання Політ (Fly) на випадкову істоту в радіусі 60 футів від вас. Заклинання не потребує концентрації.` },
        {weight:12, name: `Ви маєте використати заклинання Масло (Grease). Заклинання не потребує концентрації.` },
        {weight:12, name: `Ви маєте використати заклинання Левітація (Levitate) на самого себе. Заклинання не потребує концентрації.` },
        {weight:12, name: `Ви маєте використати заклинання Магічна Стріла (Magic Missile) (можна кинути як заклинання 5 рівня).` },
        {weight:12, name: `Ви маєте використати заклинання Дзеркальне Зображення (Mirror Image).` },
        {weight:12, name: `Ви маєте використати заклинання Перетворення (Polymorph) на самого себе, і якщо ви провалите рятувальний кидок, ви перетворюєтеся на Козла. Закляття не потребує концентрації` },
        {weight:12, name: `Ви маєте використати заклинання Бачення Невидимого (See Invisibility). Заклинання не потребує концентрації.` },
        {weight:120, name: `Протягом наступної хвилини будь-який горючий немагічний об'єкт до якого ви доторкнетесь і який ніхто не носить і не тримає, спалахує, отримуючи 1d4 одиниць шкоди вогнем і починає горіти.` },
        {weight:120, name: `Якщо ви помрете протягом наступної години, ви негайно відродитеся, ніби на вас використали заклинання Реінкарнація.` },
        {weight:120, name: `Ви перебуваєте в стані Переляку до кінця вашого наступного ходу. DM визначає джерело вашого страху.` },
        {weight:120, name: `Ви телепортуєтеся на відстань до 60 футів у вільний простір, який ви можете бачити.` },
        {weight:120, name: `Випадкова істота в радіусі 60 футів від вас отримує стан Отруєний на 1d4 годин.` },
        {weight:120, name: `Ви випромінюєте Яскраве Світло в радіусі 30 футів протягом наступної хвилини. Будь-яка істота, яка закінчує свій хід на відстані до 5 футів від вас, отримує стан Сліпоти (Blinded) до кінця свого наступного ходу.` },
        {weight:120, name: `До трьох істот на ваш вибір, яких ви можете бачити в радіусі 30 футів від вас, отримують 1d10 одиниць некротичної шкоди. Ви відновлюєте очки здоров’я, рівні загальному числу завданої некротичної шкоди.` },
        {weight:120, name: `До трьох істот на ваш вибір, яких ви можете бачити в радіусі 30 футів від вас, отримують 4d10 одиниць шкоди від електричного струму.` },
        {weight:120, name: `Ви та всі істоти в радіусі 30 футів від вас отримують вразливість до колющої (Piercing) шкоди протягом наступної хвилини.` },
        {weight:20, name: `Ви відновлюєте 2d10 очок здоров'я.` },
        {weight:20, name: `Один союзник на ваш вибір в радіусі 300 футів від вас відновлює 2d10 очок здоров'я` },
        {weight:20, name: `Ви відновлюєте свій найнижчий витрачений слот заклинання` },
        {weight:20, name: `Один союзник на ваш вибір в радіусі 300 футів від вас відновлює свій найнижчий витрачений слот заклинання` },
        {weight:20, name: `Ви відновлюєте всі свої витрачені Очки Чарів` },
        {weight:20, name: `На одну хвилину відбувається наступне: Ви Опиняєтеся в оточенні тихої, ефірної музики, яку чуєте лише ви і істоти у радіусі 5 футів.
Ваш розмір збільшується на одну категорію. 
У вас виростає довга борода з пір'я, яка залишатиметься, поки ви не чхнете; в цей момент пір'я вибухає з вашого обличчя і зникає. 
Ви повинні кричати, коли говорите. 
Ілюзорні метелики літають в повітрі в межах 10 футів від вас. 
На вашому чолі з'являється око, що дає вам перевагу на перевірках Мудрості (Сприйняття). 
Рожеві бульбашки виходять з вашого рота щоразу, коли ви говорите. 
Ваша шкіра набуває яскравого синього відтінку на 24 години або поки ефект не буде скасований заклинанням Зняти Прокляття.` },
    ];

    console.log("Creating table...");
    $("a[href='#deckstables'").click();
    $("#addrollabletable").click();
    setTimeout(function() {
        $(".rollabletable").find("td:contains('new-table')").last().parent().click();
        const tableWidget = $(".ui-dialog").find("span.ui-dialog-title:contains('new-table')").last().parent().parent();
        tableWidget.find("input.name").val("Wild Magic 2024 Ukr");
        for (let i = 0; i < rows.length; i++) {
            tableWidget.find("button.addtableitem").click();
            const itemWidget = $(".ui-dialog").find("span.ui-dialog-title:contains('Edit Table Item')").last().parent().parent();
            itemWidget.find("input.name").val(rows[i].name);
            itemWidget.find("input.weight").val(rows[i].weight || 1);
            itemWidget.find("button span:contains('Save Changes')").click();
        }
        console.log("Done!");
    }, 200);
})();

